create_clock -period 10.000 -name clk_100MHz -waveform {0.000 5.000} [get_ports clk_100MHz]
create_clock -period 12.000 -name VIRTUAL_clk_pll_i -waveform {0.000 6.000}
create_clock -period 6.000 -name VIRTUAL_clk_div2_bufg_in -waveform {0.000 3.000}
create_clock -period 8.000 -name VIRTUAL_clk_out1_clk_wiz_0 -waveform {0.000 4.000}
create_clock -period 5.062 -name VIRTUAL_mmcm_clkout0 -waveform {0.000 2.531}
create_clock -period 24.000 -name VIRTUAL_mmcm_ps_clk_bufg_in -waveform {0.000 12.000}
create_clock -period 46.667 -name VIRTUAL_snesclk_clk_wiz_0 -waveform {0.000 23.333}
set_input_delay -clock [get_clocks VIRTUAL_clk_pll_i] -min -add_delay 2.000 [get_ports {gpio_usb_int_tri_i[0]}]
set_input_delay -clock [get_clocks VIRTUAL_clk_pll_i] -max -add_delay 3.000 [get_ports {gpio_usb_int_tri_i[0]}]
set_input_delay -clock [get_clocks VIRTUAL_clk_div2_bufg_in] -min -add_delay 2.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_clk_div2_bufg_in] -max -add_delay 3.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clk_wiz_0] -min -add_delay 2.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clk_wiz_0] -max -add_delay 3.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_clk_pll_i] -min -add_delay 2.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_clk_pll_i] -max -add_delay 3.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_mmcm_clkout0] -min -add_delay 2.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_mmcm_clkout0] -max -add_delay 3.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_mmcm_ps_clk_bufg_in] -min -add_delay 2.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_mmcm_ps_clk_bufg_in] -max -add_delay 3.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_snesclk_clk_wiz_0] -clock_fall -min -add_delay 2.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_snesclk_clk_wiz_0] -clock_fall -max -add_delay 3.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_snesclk_clk_wiz_0] -min -add_delay 2.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_snesclk_clk_wiz_0] -max -add_delay 3.000 [get_ports reset_rtl_0]
set_input_delay -clock [get_clocks VIRTUAL_clk_pll_i] -min -add_delay 2.000 [get_ports uart_rxd]
set_input_delay -clock [get_clocks VIRTUAL_clk_pll_i] -max -add_delay 3.000 [get_ports uart_rxd]
set_input_delay -clock [get_clocks VIRTUAL_clk_pll_i] -min -add_delay 2.000 [get_ports usb_spi_miso]
set_input_delay -clock [get_clocks VIRTUAL_clk_pll_i] -max -add_delay 3.000 [get_ports usb_spi_miso]
create_clock -period 40.000 -name VIRTUAL_clk_out2_clk_wiz_0 -waveform {0.000 20.000}
set_output_delay -clock [get_clocks VIRTUAL_clk_out2_clk_wiz_0] -min -add_delay 0.000 [get_ports {hdmi_tmds_data_n[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_out2_clk_wiz_0] -max -add_delay 1.200 [get_ports {hdmi_tmds_data_n[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_out2_clk_wiz_0] -min -add_delay 0.000 [get_ports {hdmi_tmds_data_p[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_out2_clk_wiz_0] -max -add_delay 1.200 [get_ports {hdmi_tmds_data_p[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_pll_i] -min -add_delay 0.000 [get_ports ddr3_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_clk_pll_i] -max -add_delay 1.200 [get_ports ddr3_reset_n]
set_output_delay -clock [get_clocks VIRTUAL_clk_pll_i] -min -add_delay 0.000 [get_ports gpio_usb_rst_tri_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_pll_i] -max -add_delay 1.200 [get_ports gpio_usb_rst_tri_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out2_clk_wiz_0] -min -add_delay 0.000 [get_ports hdmi_tmds_clk_n]
set_output_delay -clock [get_clocks VIRTUAL_clk_out2_clk_wiz_0] -max -add_delay 1.200 [get_ports hdmi_tmds_clk_n]
set_output_delay -clock [get_clocks VIRTUAL_clk_out2_clk_wiz_0] -min -add_delay 0.000 [get_ports hdmi_tmds_clk_p]
set_output_delay -clock [get_clocks VIRTUAL_clk_out2_clk_wiz_0] -max -add_delay 1.200 [get_ports hdmi_tmds_clk_p]
set_output_delay -clock [get_clocks VIRTUAL_clk_pll_i] -min -add_delay 0.000 [get_ports uart_txd]
set_output_delay -clock [get_clocks VIRTUAL_clk_pll_i] -max -add_delay 1.200 [get_ports uart_txd]
set_output_delay -clock [get_clocks VIRTUAL_clk_pll_i] -min -add_delay 0.000 [get_ports usb_spi_mosi]
set_output_delay -clock [get_clocks VIRTUAL_clk_pll_i] -max -add_delay 1.200 [get_ports usb_spi_mosi]
set_output_delay -clock [get_clocks VIRTUAL_clk_pll_i] -min -add_delay 0.000 [get_ports usb_spi_sclk]
set_output_delay -clock [get_clocks VIRTUAL_clk_pll_i] -max -add_delay 1.200 [get_ports usb_spi_sclk]
set_output_delay -clock [get_clocks VIRTUAL_clk_pll_i] -min -add_delay 0.000 [get_ports usb_spi_ss]
set_output_delay -clock [get_clocks VIRTUAL_clk_pll_i] -max -add_delay 1.200 [get_ports usb_spi_ss]
